Revit 2027 API
EnergyModelType Enumeration
Note: This API is now obsolete.
 This enum is used to define if the energy model is based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public enum EnergyModelType
<ObsoleteAttribute("EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit.")>
Public Enumeration EnergyModelType
[ObsoleteAttribute(L"EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public enum class EnergyModelType
[<ObsoleteAttribute("EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit.")>]
type EnergyModelType
Members
Member name | Value | Description
AnalysisMode | 2 |  Energy model based on analysis mode in EnergyDataSettings.
BuildingElement | 1 |  The building element based energy analytical model.
SpatialElement | 0 |  Energy model based on rooms or spaces.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace